---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs
source: html/f5598e88-ad93-a085-475a-a4a2b825ef25.htm
---
# DocumentSavingAsEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.